# Pandas

In [2]:
import numpy as np
import pandas as pd

In [ ]:
data = {'animal': ['cat', 'cat', 'snake', 'dog', 'dog', 'cat', 'snake', 'cat', 'dog', 'dog'],
        'age': [2.5, 3, 0.5, np.nan, 5, 2, 4.5, np.nan, 7, 3],
        'visits': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

#### 0. Создать датафрейм.

In [ ]:
df = pd.DataFrame(data, labels)
df

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  2.0       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no

#### 1. Вывести информацию о датафрейме.

In [ ]:
type(df)

pandas.core.frame.DataFrame

#### 2. Вернуть первые 3 строки DataFrame `df`.

In [ ]:
df[:3]

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no

#### 3. Выберите только столбцы 'animal' и 'age' из DataFrame `df`.

In [ ]:
df[['animal', 'age']]

  animal  age
a    cat  2.5
b    cat  3.0
c  snake  0.5
d    dog  NaN
e    dog  5.0
f    cat  2.0
g  snake  4.5
h    cat  NaN
i    dog  7.0
j    dog  3.0

#### 4. Выберите данные в строках `[3, 4, 8]` * и * в столбцах `['animal', 'age']`.

In [ ]:
df.loc[[3, 4, 8], ['animal', 'age']]

KeyError: ignored

#### 5. Выберите строки где количество посещений больше 3.

In [ ]:
df[df.visits > 3]

Empty DataFrame
Columns: [animal, age, visits, priority]
Index: []

#### 6. Выберите строки, в которых отсутствует возраст.

In [ ]:
df[pd.isnull(df.age)]

  animal  age  visits priority
d    dog  NaN       3      yes
h    cat  NaN       1      yes

#### 7. Выберите строки, в которых животное является кошкой * и * возраст составляет менее 3 лет.

In [ ]:
df[(df.animal == "cat")&(df.age < 3)]

  animal  age  visits priority
a    cat  2.5       1      yes
f    cat  2.0       3       no

#### 8. Выберите строки в которых возраст от 2 до 4 (включительно).

In [ ]:
df[(df.age <= 4)&(df.age >= 2)]

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
f    cat  2.0       3       no
j    dog  3.0       1       no

#### 9. Измените возраст в строке 'f' на 1,5.

In [ ]:
df.loc['f', 'age'] = 1.5
df

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  1.5       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no

#### 10. Рассчитать общее количество всех посещений.

In [ ]:
df.visits.sum()

19

#### 11. Расчитайте суммарный возраст животных

In [ ]:
df.age.sum()

27.0

#### 12. Добавьте новую строку `k` к `df` со значениями по вашему желанию. Затем удалите ее.

In [ ]:
df.loc['n', 'age'] = 1.5
df.loc['n', 'animal'] = "slon"
df.loc['n', 'visits'] = "100500"
df.loc['n', 'priority'] = "yes"
print(df, "\n---------------------------------------")
df.drop('n', inplace=True)
df

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  1.5       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no
n   slon  1.5  100500      yes
---------------------------------------

  animal  age visits priority
a    cat  2.5      1      yes
b    cat  3.0      3      yes
c  snake  0.5      2       no
d    dog  NaN      3      yes
e    dog  5.0      2       no
f    cat  1.5      3       no
g  snake  4.5      1       no
h    cat  NaN      1      yes
i    dog  7.0      2       no
j    dog  3.0      1       no

#### 13. Подсчитайте количество животных каждого типа в `df`.

In [ ]:
df.groupby('animal').count().priority

animal
cat      4
dog      4
snake    2
Name: priority, dtype: int64

#### 14. Сортируйте `df` сначала по значениям в 'age' в * возрастающем * порядке, затем по значениям в столбце 'visit' в * возрастающем * порядке.

In [ ]:
df.sort_values(by=['age', 'visits'], ascending=[True, True])

  animal  age visits priority
c  snake  0.5      2       no
f    cat  1.5      3       no
a    cat  2.5      1      yes
j    dog  3.0      1       no
b    cat  3.0      3      yes
g  snake  4.5      1       no
e    dog  5.0      2       no
i    dog  7.0      2       no
h    cat  NaN      1      yes
d    dog  NaN      3      yes


#### 15. В столбце приоритет замените значения на `Yes` и `No`

In [ ]:
df.priority.replace(to_replace=['no', 'yes'], value=['yes', 'no'], inplace=True)
df

  animal  age visits priority
a    cat  2.5      1       no
b    cat  3.0      3       no
c  snake  0.5      2      yes
d    dog  NaN      3       no
e    dog  5.0      2      yes
f    cat  1.5      3      yes
g  snake  4.5      1      yes
h    cat  NaN      1       no
i    dog  7.0      2      yes
j    dog  3.0      1      yes

#### 16. В столбце «animal» измените записи «snake» на «python».

In [ ]:
df.animal.replace(to_replace=['snake'], value=['python'], inplace=True)
df

   animal  age visits priority
a     cat  2.5      1       no
b     cat  3.0      3       no
c  python  0.5      2      yes
d     dog  NaN      3       no
e     dog  5.0      2      yes
f     cat  1.5      3      yes
g  python  4.5      1      yes
h     cat  NaN      1       no
i     dog  7.0      2      yes
j     dog  3.0      1      yes

#### 17. Удалите все повторения строк из таблицы
```python
df = pd.DataFrame ({'A': [1, 2, 2, 3, 4, 5, 5, 5, 6, 7, 7]})
```

In [ ]:
df1 = pd.DataFrame ({'A': [1, 2, 2, 3, 4, 5, 5, 5, 6, 7, 7]})
df1 = pd.DataFrame ({'A': df1.A.unique()})
df1

   A
0  1
1  2
2  3
3  4
4  5
5  6
6  7

#### 20. Предположим, у вас есть DataFrame с 10 столбцами действительных чисел, например:

```python
df = pd.DataFrame (np.random.random (size = (5, 10)), columns = список ('abcdefghij'))
```
#### Какой столбец имеет наименьшую сумму? Найдите метку этого столбца.

In [ ]:
df1 = pd.DataFrame (np.random.random (size = (5, 10)), columns = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j'])
a = min(df1.sum())
df1.sum()[(df1.sum() == a)]

j    1.631256
dtype: float64

In [ ]:
from google.colab import drive
drive.mount('/content/drive')

Mounted at /content/drive

#### 21. Замените все пропущенные значения, на среднее по столбцу
```python
df = pd.DataFrame({'group': list('aabbabbbabab'),
                       'value': [1, 2, 3, np.nan, 2, 3, 
                                 np.nan, 1, 7, 3, np.nan, 8]})
```

In [ ]:
df = pd.DataFrame({'group': list('aabbabbbabab'),
                       'value': [1, 2, 3, np.nan, 2, 3, 
                                 np.nan, 1, 7, 3, np.nan, 8]})
print(df)
df.fillna(df.value.mean())

   group  value
0      a    1.0
1      a    2.0
2      b    3.0
3      b    NaN
4      a    2.0
5      b    3.0
6      b    NaN
7      b    1.0
8      a    7.0
9      b    3.0
10     a    NaN
11     b    8.0

   group     value
0      a  1.000000
1      a  2.000000
2      b  3.000000
3      b  3.333333
4      a  2.000000
5      b  3.000000
6      b  3.333333
7      b  1.000000
8      a  7.000000
9      b  3.000000
10     a  3.333333
11     b  8.000000

#### 22. Создайте два новых столбца, для From и To. Приведите названия городов к нормальному виду.

```python
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN', 'londON_StockhOlm', 
                               'Budapest_PaRis', 'Brussels_londOn'],
              'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
              'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
                   'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )', 
                               '12. Air France', '"Swiss Air"']})
```

In [13]:
x = "ysjhfJJJ"
y = x[0].capitalize() + x[1:].lower()
y

'Ysjhfjjj'

In [29]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN', 'londON_StockhOlm', 
                               'Budapest_PaRis', 'Brussels_londOn'],
              'FlightNumber': [10045, np.nan, 10065, np.nan, 10085],
              'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]],
                   'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )', 
                               '12. Air France', '"Swiss Air"']})

def normal_view(x):
  y = x[0].capitalize() + x[1:].lower()
  return y

new_columns = df.From_To.str.split('_')
new_columns0, new_columns1 = [], []

for i in range(len(new_columns)):
  new_columns0.append(normal_view(new_columns[i][0])),  new_columns1.append(normal_view(new_columns[i][1]))


df['From'] = new_columns0
df['To'] = new_columns1


df

            From_To  FlightNumber  ...      From         To
0      LoNDon_paris       10045.0  ...    London      Paris
1      MAdrid_miLAN           NaN  ...    Madrid      Milan
2  londON_StockhOlm       10065.0  ...    London  Stockholm
3    Budapest_PaRis           NaN  ...  Budapest      Paris
4   Brussels_londOn       10085.0  ...  Brussels     London

[5 rows x 6 columns]